[{"id":1,"title":"Computadora portátil Apple MacBook Pro","description":"La MacBook Pro es una computadora portátil de alta gama de Apple. Cuenta con un procesador Intel Core i9 de 10.ª generación, 32 GB de RAM y una tarjeta gráfica NVIDIA GeForce RTX 3080.","price":20000,"thumbnail":"No existe imágen para este producto","code":"M1-MBP","stock":10},{"id":2,"title":"Ordenador de sobremesa Dell XPS 8950","description":"El Dell XPS 8950 es un ordenador de sobremesa de alta gama de Dell. Cuenta con un procesador Intel Core i9 de 12.ª generación, 64 GB de RAM y una tarjeta gráfica NVIDIA GeForce RTX 4090.","price":30000,"thumbnail":"No existe imágen para este producto","code":"XPS-8950","stock":5},{"id":3,"title":"Monitor gaming ASUS ROG Swift PG27UQ","description":"El ASUS ROG Swift PG27UQ es un monitor gaming de 27 pulgadas con una resolución 4K y una frecuencia de actualización de 144 Hz. Cuenta con la tecnología NVIDIA G-SYNC para una experiencia de juego fluida y sin tearing.","price":2500,"thumbnail":"No existe imágen para este producto","code":"PG27UQ","stock":20},{"id":4,"title":"Placa base ASUS ROG Strix Z690-A Gaming WiFi","description":"La ASUS ROG Strix Z690-A Gaming WiFi es una placa base para juegos de alta gama de ASUS. Cuenta con un chipset Intel Z690, soporte para memoria DDR5 y un diseño de audio SupremeFX.","price":5000,"thumbnail":"No existe imágen para este producto","code":"Z690-A","stock":15},{"id":5,"title":"Tarjeta gráfica NVIDIA GeForce RTX 3090 Ti","description":"La NVIDIA GeForce RTX 3090 Ti es una tarjeta gráfica de gama alta de NVIDIA. Cuenta con 10496 núcleos CUDA, 24 GB de memoria GDDR6X y un rendimiento de juego líder en el mercado.","price":20000,"thumbnail":"No existe imágen para este producto","code":"RTX-3090-Ti","stock":10},{"id":6,"title":"Memoria RAM Corsair Vengeance RGB Pro","description":"La Corsair Vengeance RGB Pro es una memoria RAM de alta velocidad de Corsair. Cuenta con un diseño RGB personalizable y velocidades de hasta 3600 MHz.","price":300,"thumbnail":"No existe imágen para este producto","code":"Vengeance-RGB-Pro","stock":25},{"id":7,"title":"Disco duro SSD Samsung 980 Pro","description":"El Samsung 980 Pro es un disco duro SSD de alta velocidad de Samsung. Cuenta con una interfaz PCIe 4.0 y velocidades de lectura y escritura de hasta 7000 MB/s y 5000 MB/s, respectivamente.","price":1000,"thumbnail":"No existe imágen para este producto","code":"980-Pro","stock":5},{"id":8,"title":"Teclado mecánico Razer BlackWidow V3 Pro","description":"El Razer BlackWidow V3 Pro es un teclado mecánico inalámbrico de alta gama de Razer. Cuenta con interruptores mecánicos Razer Green, iluminación RGB Chroma personalizable y una batería que dura hasta 200 horas.","price":1500,"thumbnail":"No existe imágen para este producto","code":"BlackWidow-V3-Pro","stock":10},{"id":9,"title":"Ratón inalámbrico Logitech G502 Lightspeed","description":"El Logitech G502 Lightspeed es un ratón inalámbrico de alta gama de Logitech. Cuenta con un sensor HERO 25K, 11 botones programables y una batería que dura hasta 60 horas.","price":1000,"thumbnail":"No existe imágen para este producto","code":"G502-Lightspeed","stock":20},{"id":10,"title":"Cascos gaming HyperX Cloud Alpha","description":"Los HyperX Cloud Alpha son unos auriculares gaming de alta gama de HyperX. Cuentan con un diseño circumaural, almohadillas de espuma viscoelástica y un sonido envolvente 7.1.","price":500,"thumbnail":"No existe imágen para este producto","code":"Cloud-Alpha","stock":5}]